In [11]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [33]:
df= pd.DataFrame(randn(5,4),index='A,B,C,D,E'.split(','),columns= 'W,X,Y,Z'.split(','))

In [13]:
df

          W         X         Y         Z
A  0.414540 -1.590974 -0.605439 -0.421584
B -0.291423  0.627287  1.486957 -1.159801
C  1.706972 -0.577038  1.287590 -0.571162
D  0.035422 -0.567061  0.120524  1.191297
E -0.389751  1.549999 -1.085557 -0.078508

In [16]:
df['W']

A    0.414540
B   -0.291423
C    1.706972
D    0.035422
E   -0.389751
Name: W, dtype: float64

In [17]:
df[['W','X','Y','Z']]

          W         X         Y         Z
A  0.414540 -1.590974 -0.605439 -0.421584
B -0.291423  0.627287  1.486957 -1.159801
C  1.706972 -0.577038  1.287590 -0.571162
D  0.035422 -0.567061  0.120524  1.191297
E -0.389751  1.549999 -1.085557 -0.078508

In [19]:
df[['Y','Z']]

          Y         Z
A -0.605439 -0.421584
B  1.486957 -1.159801
C  1.287590 -0.571162
D  0.120524  1.191297
E -1.085557 -0.078508

In [20]:
type(df['W'])

pandas.core.series.Series

In [22]:
df.W

A    0.414540
B   -0.291423
C    1.706972
D    0.035422
E   -0.389751
Name: W, dtype: float64

In [23]:
df.Z

A   -0.421584
B   -1.159801
C   -0.571162
D    1.191297
E   -0.078508
Name: Z, dtype: float64

In [26]:
df.loc[['A']]

         W         X         Y         Z
A  0.41454 -1.590974 -0.605439 -0.421584

In [25]:
df.loc[['A','B']]

          W         X         Y         Z
A  0.414540 -1.590974 -0.605439 -0.421584
B -0.291423  0.627287  1.486957 -1.159801

In [27]:
df.iloc[['3']]

          W         X         Y         Z
D  0.035422 -0.567061  0.120524  1.191297

In [34]:
df['new']=df['X']+10

In [35]:
df

          W         X         Y         Z        new
A  0.135539  0.044787 -0.267621 -0.223843  10.044787
B -0.205808 -0.732937  0.899955  0.659296   9.267063
C  1.572118  1.578086 -1.070735  0.121692  11.578086
D -1.423299 -0.444070 -0.557221  1.907540   9.555930
E  0.283347 -0.088299 -0.487571  0.506344   9.911701

In [40]:
df.drop('new',axis=1,inplace=True)

In [41]:
df

          W         X         Y         Z
A  0.135539  0.044787 -0.267621 -0.223843
B -0.205808 -0.732937  0.899955  0.659296
C  1.572118  1.578086 -1.070735  0.121692
D -1.423299 -0.444070 -0.557221  1.907540
E  0.283347 -0.088299 -0.487571  0.506344

In [42]:
df.drop('A',axis=0,)

          W         X         Y         Z
B -0.205808 -0.732937  0.899955  0.659296
C  1.572118  1.578086 -1.070735  0.121692
D -1.423299 -0.444070 -0.557221  1.907540
E  0.283347 -0.088299 -0.487571  0.506344

In [43]:
df

          W         X         Y         Z
A  0.135539  0.044787 -0.267621 -0.223843
B -0.205808 -0.732937  0.899955  0.659296
C  1.572118  1.578086 -1.070735  0.121692
D -1.423299 -0.444070 -0.557221  1.907540
E  0.283347 -0.088299 -0.487571  0.506344

In [44]:

                  ###Conditional Selection##

In [45]:
df

          W         X         Y         Z
A  0.135539  0.044787 -0.267621 -0.223843
B -0.205808 -0.732937  0.899955  0.659296
C  1.572118  1.578086 -1.070735  0.121692
D -1.423299 -0.444070 -0.557221  1.907540
E  0.283347 -0.088299 -0.487571  0.506344

In [46]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False  False   True   True
C   True   True  False   True
D  False  False  False   True
E   True  False  False   True

In [47]:
df[df>0]

          W         X         Y         Z
A  0.135539  0.044787       NaN       NaN
B       NaN       NaN  0.899955  0.659296
C  1.572118  1.578086       NaN  0.121692
D       NaN       NaN       NaN  1.907540
E  0.283347       NaN       NaN  0.506344

In [61]:
df[df['X']>0]

          W         X         Y         Z
A  0.135539  0.044787 -0.267621 -0.223843
C  1.572118  1.578086 -1.070735  0.121692

In [62]:
df[df['W']>0]['Z']

A   -0.223843
C    0.121692
E    0.506344
Name: Z, dtype: float64

In [59]:
df[df['W']>0][['Z','X']]

          Z         X
A -0.223843  0.044787
C  0.121692  1.578086
E  0.506344 -0.088299

In [58]:
df[(df['X']>0) & (df['Z'] > 0)]

          W         X         Y         Z
C  1.572118  1.578086 -1.070735  0.121692